export interface Destination {
  name: string;
  lat: number;
  lng: number;
  bounds?: {
    north: number;
    south: number;
    east: number;
    west: number;
  };
}


export const destinationList: Destination[] = [
  {
    name: 'Τμήμα Μαιευτικής',
    lat: 40.6574524,
    lng: 22.8058218,
    bounds: {
      north: 40.65773663031656,
      south: 40.65716822341605,
      east: 22.80616657898256,
      west: 22.805477087514166,
    },
  },
  {
    name: 'Τμήμα Νοσηλευτικής',
    lat: 40.657477353074515,
    lng: 22.804638050453958,
    bounds: {
      north: 40.657764313250745,
      south: 40.657190392898286,
      east: 22.805310757942934,
      west: 22.803965342964982,
    },
  },
  {
    name: 'Τμήμα Διατροφής και Διαιτολογίας',
    lat: 40.65812125923696,
    lng: 22.804535601874716,
    bounds: {
      north: 40.65830909808419,
      south: 40.65793439627186,
      east: 22.80389173229861,
      west: 22.803574033587765,
    },
  },
  {
    name: 'Τμήμα Ζωικής Παραγωγής',
    lat: 40.6582175,
    lng: 22.8037,
    bounds: {
      north: 40.658563211461626,
      south: 40.658381873851155,
      east: 22.804035278603152,
      west: 22.803383688928058
    },
  },
  {
    name: 'Τμήμα Επιστήμης και Τεχνολογίας Τροφίμων',
    lat: 40.6567,
    lng: 22.7997,
    bounds: {
     north: 40.65612899440734,
      south: 40.65582919548413,
      east: 22.802542588081376,
      west: 22.80214341437482
    },
  },
  {
    name: 'Τμήμα Μηχανικών Παραγωγής και Διοίκησης',
    lat: 40.65650595466751,
    lng: 22.80311965195076,
    bounds: {
      north: 40.65659137509818,
      south: 40.656420534236844,
      east: 22.80445814145301,
      west: 22.803781160918508,
    },
  },
  {
    name: 'Τμήμα Μηχανικών Παραγωγής και Διοίκησης (Παράρτημα Οχημάτων)',
    lat: 40.655930817748655,
    lng: 22.804107604255066,
    bounds: {
      north: 40.65557450714685,
      south: 40.65524745099111,
      east: 22.80355098077984,
      west: 22.802956211957078
    },
  },

  {
     name: 'Τμήμα Μηχανικών Πληροφορικής (Κτήριο Η)',
      lat: 40.65545, lng: 22.8061,
      bounds: {
        north: 40.655744513978334,
        south: 40.655155846219564,
        east: 22.806469245292412,
        west: 22.8056366998561
    },
  },
  {
    name: 'Σχολή Οικονομίας και Διοίκησης (ΣΔΟ)',
    lat: 40.65655207949972,
    lng: 22.803737963642393,
    bounds: {
      north: 40.65664190484502,
      south: 40.65646225415442,
      east: 22.803787211698438,
      west: 22.803688715586347,
    },
  },
  {
    name: 'Φοιτητικές Εστίες',
    lat: 40.65807484993894,
    lng: 22.804535601874716,
    bounds: {
      north: 40.658319121448585,
      south: 40.65783057842929,
      east: 22.8050747286739,
      west: 22.803996475075532,
    },
  },
  {
    name: 'Βιβλιοθήκη',
    lat: 40.6573,
    lng: 22.8012,
    bounds: {
      north: 40.65745,
      south: 40.65715,
      east: 22.8015,
      west: 22.8009,
    },
  },
  {
    name: 'Τμήμα Μηχανικών Πληροφορικής (Κτήριο Π)',
  lat: 40.655989227, // μέσος όρος μεταξύ north/south
  lng: 22.804107604, // μέσος όρος μεταξύ east/west
  bounds: {
    north: 40.65607925374713,
    south: 40.65589920105018,
    east: 22.8044453540746,
    west: 22.803769854435533
  },
  },
  {
    name: 'Κυλικείο',
    lat: 40.6575,
    lng: 22.8016,
    bounds: {
      north: 40.65765,
      south: 40.65740,
      east: 22.8018,
      west: 22.8014,
    },
  },
  {
    name: 'Ιατρείο',
    lat: 40.6569,
    lng: 22.8021,
    bounds: {
      north: 40.65705,
      south: 40.65685,
      east: 22.8023,
      west: 22.8019,
    },
  },
  {
    name: 'Διοίκηση',
    lat: 40.6566,
    lng: 22.8031,
    bounds: {
      north: 40.65675,
      south: 40.65650,
      east: 22.8033,
      west: 22.8029,
    },
  },
];

