export interface Destination {
  name: string;
  lat: number;        // center latitude
  lng: number;        // center longitude
  entranceLat?: number; // entrance latitude
  entranceLng?: number; // entrance longitude
  image?: string;
  description?: string;
  phone?: string;
  bounds?: {
    north: number;
    south: number;
    east: number;
    west: number;
  };
}

export const destinationList: Destination[] = [
  {
    name: 'Τμήμα Μαιευτικής',
    lat: 40.6574524,
    lng: 22.8058218,
    image: 'assets/images/dipae_logo.png',
    description: 'Το Τμήμα Μαιευτικής προσφέρει υψηλού επιπέδου εκπαίδευση στη φροντίδα της γυναίκας και του νεογνού.',
    phone: '2310123450',
    bounds: {
      north: 40.65777326555862,
      south: 40.65705680374365,
      east: 22.80619695674264,
      west: 22.805390576278832,
    },
  },
  {
    name: 'Τμήμα Νοσηλευτικής',
    lat: 40.657477353074515,
    lng: 22.804638050453958,
    image: 'assets/images/dipae_logo.png',
    description: 'Εκπαίδευση και πρακτική στη φροντίδα υγείας και τη νοσηλευτική επιστήμη.',
    phone: '2310123451',
    bounds: {
      north: 40.65777160324301,
      south: 40.65714490735149,
      east: 22.80529854371273,
      west: 22.80468718461109,
    },
  },
  {
    name: 'Τμήμα Φυσικοθεραπείας',
    lat: 40.657466,
    lng: 22.804275,
    image: 'assets/images/dipae_logo.png',
    description: 'Σπουδές στην αποκατάσταση και θεραπεία κινητικών δυσλειτουργιών.',
    phone: '2310123499',
    bounds: {
      north: 40.65777160324365,
      south: 40.6571814786269,
      east: 22.804676228348686,
      west: 22.803920246663868,
    },
  },
  {
    name: 'Τμήμα Διατροφής και Διαιτολογίας',
    lat: 40.657982466111285,
    lng: 22.803599936573498,
    image: 'assets/images/dipae_logo.png',
    description: 'Ασχολείται με τη διατροφή, την υγιεινή και την πρόληψη παθήσεων μέσω της δίαιτας.',
    phone: '2310123452',
    bounds: {
      north: 40.65832332551336,
      south: 40.657902219448545,
      east: 22.803882225197363,
      west: 22.803486702151677,
    },
  },
  {
    name: 'Τμήμα Ζωικής Παραγωγής',
    lat: 40.6582175,
    lng: 22.8037,
    image: 'assets/images/dipae_logo.png',
    description: 'Σπουδές στη διαχείριση ζωικών πόρων, παραγωγής και φροντίδας ζώων.',
    phone: '2310123453',
    bounds: {
      north: 40.658563211461626,
      south: 40.658381873851155,
      east: 22.804035278603152,
      west: 22.803383688928058,
    },
  },
  {
    name: 'Τμήμα Επιστήμης και Τεχνολογίας Τροφίμων',
    lat: 40.65589409142455,
    lng: 22.80212574590458,
    image: 'assets/images/dipae_logo.png',
    description: 'Μελέτη της παραγωγής και ελέγχου ποιότητας τροφίμων.',
    phone: '2310123454',
    bounds: {
      north: 40.65615312676459,
      south: 40.65580193437832,
      east: 22.80254434974311,
      west: 22.802129029071942,
    },
  }, 
  // {
  //   name: 'Τμήμα Μηχανικών Παραγωγής και Διοίκησης',
  //   lat: 40.65650595466751,
  //   lng: 22.80311965195076,
  //   image: 'assets/images/dipae_logo.png',
  //   description: 'Σπουδές στη διοίκηση έργων, παραγωγής και τεχνολογικών υποδομών.',
  //   phone: '2310123455',
  //   bounds: {
  //     north: 40.65659137509818,
  //     south: 40.656420534236844,
  //     east: 22.80445814145301,
  //     west: 22.803781160918508,
  //   },
  // },
  {
    name: 'Τμήμα Μηχανικών Παραγωγής και Διοίκησης (Παράρτημα Οχημάτων)',
    lat: 40.655509910487886,
    lng: 22.803277927010416,
    image: 'assets/images/dipae_logo.png',
    description: 'Εξειδίκευση στη μελέτη και διαχείριση μηχανοκίνητων οχημάτων και παραγωγικών διαδικασιών.',
    phone: '2310123456',
    bounds: {
      north: 40.65558532912994,
      south: 40.65519112860029,
      east: 22.80350543890108,
      west: 22.80289022817632,
    },
  },
  {
    name: 'Τμήμα Μηχανικών Πληροφορικής (Κτήριο Η)',
    lat: 40.65545,
    lng: 22.8061,
    image: 'assets/images/dipae_logo.png',
    description: 'Καινοτόμα έρευνα και εφαρμογές στον τομέα της πληροφορικής.',
    phone: '2310123457',
    bounds: {
      north: 40.655744513978334,
      south: 40.655155846219564,
      east: 22.806469245292412,
      west: 22.8056366998561,
    },
  },
  {
    name: 'Τμήμα Μηχανικών Πληροφορικής (Κτήριο Π)',
    lat: 40.655989227,
    lng: 22.804107604,
    image: 'assets/images/dipae_logo.png',
    description: 'Προγραμματισμός, τεχνητή νοημοσύνη και σύγχρονες υπολογιστικές τεχνολογίες.',
    phone: '2310123458',
    bounds: {
      north: 40.65607925374713,
      south: 40.65589920105018,
      east: 22.8044453540746,
      west: 22.803769854435533,
    },
  },
  {
    name: 'Τμήμα Διοίκησης Οργανισμών, Μάρκετινγκ και Τουρισμού',
    lat: 40.657195707236276,
    lng: 22.80373743112278,
    image: 'assets/images/dipae_logo.png',
    description: 'Σπουδές στη διοίκηση οργανισμών, μάρκετινγκ και τουρισμού.',
    phone: '2310123459',
    bounds: {
      north: 40.657191867988715,
      south: 40.656646544466795,
      east: 22.8038522328527,
      west: 22.803650995698128,
    },
  },
  
// ---------------------------------------------------------------------


  // 1️⃣ Τμήμα Μαιευτικής
  {
    name: 'Τμήμα Μαιευτικής',
    lat: 40.65749725294477,
    lng: 22.80582768425436,
    entranceLat: 40.657442589883715,
    entranceLng: 22.805423778009388,
    image: 'assets/images/dipae_logo.png',
    description: 'Το Τμήμα Μαιευτικής προσφέρει υψηλού επιπέδου εκπαίδευση στη φροντίδα της γυναίκας και του νεογνού.',
    phone: '2310123450',
    bounds: {
      north: 40.65777326555862,
      south: 40.65705680374365,
      east: 22.80619695674264,
      west: 22.805390576278832,
    },
  },

  // 2️⃣ Τμήμα Νοσηλευτικής
  {
    name: 'Τμήμα Νοσηλευτικής',
    lat: 40.657512259067374,
    lng: 22.805006877643027,
    entranceLat: 40.65741476060173,
    entranceLng: 22.80496845970978,
    image: 'assets/images/dipae_logo.png',
    description: 'Εκπαίδευση και πρακτική στη φροντίδα υγείας και τη νοσηλευτική επιστήμη.',
    phone: '2310123451',
    bounds: {
      north: 40.65777160324301,
      south: 40.65714490735149,
      east: 22.80529854371273,
      west: 22.80468718461109,
    },
  },

  // 3️⃣ Τμήμα Φυσικοθεραπείας
  {
    name: 'Τμήμα Φυσικοθεραπείας',
    lat: 40.657488597710554,
    lng: 22.804320695658898,
    entranceLat: 40.65741138690423,
    entranceLng: 22.804248465976954,
    image: 'assets/images/dipae_logo.png',
    description: 'Σπουδές στην αποκατάσταση και θεραπεία κινητικών δυσλειτουργιών.',
    phone: '2310123499',
    bounds: {
      north: 40.65777160324365,
      south: 40.6571814786269,
      east: 22.804676228348686,
      west: 22.803920246663868,
    },
  },

  // 4️⃣ Τμήμα Διατροφής και Διαιτολογίας
  {
    name: 'Τμήμα Διατροφής και Διαιτολογίας',
    lat: 40.658154624342295,
    lng: 22.803683105931498,
    entranceLat: 40.658006430808285,
    entranceLng: 22.803597743580113,
    image: 'assets/images/dipae_logo.png',
    description: 'Ασχολείται με τη διατροφή, την υγιεινή και την πρόληψη παθήσεων μέσω της δίαιτας.',
    phone: '2310123452',
    bounds: {
      north: 40.65832332551336,
      south: 40.657902219448545,
      east: 22.803882225197363,
      west: 22.803486702151677,
    },
  },
  // 5️⃣ Τμήμα Φυτικής Παραγωγής
  {
    name: 'Τμήμα Φυτικής Παραγωγής',
    lat: 40.65694144730436,
    lng: 22.802900568222984,
    entranceLat: 40.65698723807002,
    entranceLng: 22.80260457061013,
    image: 'assets/images/dipae_logo.png',
    description: 'Σπουδές στη φυτική παραγωγή και αγροτική ανάπτυξη.',
    phone: '2310123497',
    bounds: {
      north: 40.65705005501571,
      south: 40.65681707169548,
      east: 22.802953394548545,
      west: 22.802602025174547,
    },
  },

  // 6️⃣ Τμήμα Επιστήμης και Τεχνολογίας Τροφίμων
  {
    name: 'Τμήμα Επιστήμης και Τεχνολογίας Τροφίμων',
    lat: 40.655996934639994,
    lng: 22.802312853374616,
    entranceLat: 40.65585974854294,
    entranceLng: 22.802158248369402,
    image: 'assets/images/dipae_logo.png',
    description: 'Μελέτη της παραγωγής και ελέγχου ποιότητας τροφίμων.',
    phone: '2310123454',
    bounds: {
      north: 40.65615312676459,
      south: 40.65580193437832,
      east: 22.80254434974311,
      west: 22.802129029071942,
    },
  },

  // 7️⃣ Τμήμα Μηχανικών Παραγωγής και Διοίκησης (Παράρτημα Οχημάτων)
  {
    name: 'Τμήμα Μηχανικών Παραγωγής και Διοίκησης (Παράρτημα Οχημάτων)',
    lat: 40.65542234468539,
    lng: 22.80319602368392,
    entranceLat: 40.65554652009317,
    entranceLng: 22.803217274195887,
    image: 'assets/images/dipae_logo.png',
    description: 'Εξειδίκευση στη μελέτη και διαχείριση μηχανοκίνητων οχημάτων και παραγωγικών διαδικασιών.',
    phone: '2310123456',
    bounds: {
      north: 40.65558532912994,
      south: 40.65519112860029,
      east: 22.80350543890108,
      west: 22.80289022817632,
    },
  },

  // 8️⃣ Τμήμα Μηχανικών Πληροφορικής (Κτήριο Η)
  {
    name: 'Τμήμα Μηχανικών Πληροφορικής (Κτήριο Η)',
    lat: 40.655467886331,
    lng: 22.80587503575322,
    entranceLat: 40.6556801165255,
    entranceLng: 22.8057602909593,
    image: 'assets/images/dipae_logo.png',
    description: 'Καινοτόμα έρευνα και εφαρμογές στον τομέα της πληροφορικής.',
    phone: '2310123457',
    bounds: {
      north: 40.655744513978334,
      south: 40.655155846219564,
      east: 22.806469245292412,
      west: 22.8056366998561,
    },
  },
  // 9️⃣ Τμήμα Μηχανικών Πληροφορικής (Κτήριο Π)
  {
    name: 'Τμήμα Μηχανικών Πληροφορικής (Κτήριο Π)',
    lat: 40.656001630173606,
    lng: 22.804052777323523,
    entranceLat: 40.65587753014149,
    entranceLng: 22.804064757176615,
    image: 'assets/images/dipae_logo.png',
    description: 'Προγραμματισμός, τεχνητή νοημοσύνη και σύγχρονες υπολογιστικές τεχνολογίες.',
    phone: '2310123458',
    bounds: {
      north: 40.65607925374713,
      south: 40.65589920105018,
      east: 22.8044453540746,
      west: 22.803769854435533,
    },
  },

  // 🔟 Τμήμα Διοίκησης Οργανισμών, Μάρκετινγκ και Τουρισμού
  {
    name: 'Τμήμα Διοίκησης Οργανισμών, Μάρκετινγκ και Τουρισμού',
    lat: 40.656897284456505,
    lng: 22.80372884206972,
    entranceLat: 40.65687857987505,
    entranceLng: 22.803628321838005,
    image: 'assets/images/dipae_logo.png',
    description: 'Σπουδές στη διοίκηση οργανισμών, μάρκετινγκ και τουρισμού.',
    phone: '2310123459',
    bounds: {
      north: 40.657191867988715,
      south: 40.656646544466795,
      east: 22.8038522328527,
      west: 22.803650995698128,
    },
  },

  // 1️⃣1️⃣ Τμήμα Βιβλιοθηκονομίας, Αρχειονομίας & Συστημάτων Πληροφόρησης
  {
    name: 'Τμήμα Βιβλιοθηκονομίας, Αρχειονομίας & Συστημάτων Πληροφόρησης',
    lat: 40.657455215554,
    lng: 22.80348788974662,
    entranceLat: 40.65720355937115,
    entranceLng: 22.803524571319407,
    image: 'assets/images/dipae_logo.png',
    description: 'Τμήμα Βιβλιοθηκονομίας και συστημάτων πληροφόρησης.',
    phone: '2310123498',
    bounds: {
      north: 40.65764482920283,
      south: 40.657194828366016,
      east: 22.803635189994434,
      west: 22.803348746587012,
    },
  },

  // 1️⃣2️⃣ Τμήμα Μηχανικών Περιβάλλοντος
  {
    name: 'Τμήμα Μηχανικών Περιβάλλοντος',
    lat: 40.65654685255857,
    lng: 22.802870614893244,
    entranceLat: 40.656539730755995,
    entranceLng: 22.802607758414982,
    image: 'assets/images/dipae_logo.png',
    description: 'Σπουδές στη μηχανική περιβάλλοντος.',
    phone: '2310123496',
    bounds: {
      north: 40.65664102138373,
      south: 40.65628077985187,
      east: 22.80322134626219,
      west: 22.802591883026672,
    },
  },
  // 1️⃣3️⃣ Τμήμα Λογιστικής και Πληροφοριακών Συστημάτων
  {
    name: 'Τμήμα Λογιστικής και Πληροφοριακών Συστημάτων',
    lat: 40.656515612057085,
    lng: 22.804099329099017,
    entranceLat: 40.65646309503383,
    entranceLng: 22.803648884664465,
    image: 'assets/images/dipae_logo.png',
    description: 'Σπουδές στη λογιστική και τα πληροφοριακά συστήματα.',
    phone: '2310123495',
    bounds: {
      north: 40.65661190413269,
      south: 40.656384742896115,
      east: 22.804424234084674,
      west: 22.80363490711706,
    },
  },

];

